caonam-tugraz/MultiIMU-GaitSync/firmware/master_tft/ESP32_ESP_NOW_TIME_SYNC_MASTER_TFT_2_0/ESP32_ESP_NOW_TIME_SYNC_MASTER_TFT_2_0.ino
#include <WiFi.h>
#include <esp_now.h>
#include "esp_wifi.h"
#include "esp_idf_version.h"
#include "esp_timer.h"
#include <math.h>
#include <string.h>
#include <cstddef>
#include <Adafruit_GFX.h>
#include <Adafruit_ST7789.h>
#include <SPI.h>

// Một số bản Adafruit_ST7735/ST7789 không định nghĩa macro này
#ifndef ST77XX_DARKGREY
#define ST77XX_DARKGREY 0x7BEF
#endif
#ifndef ST77XX_CYAN
#define ST77XX_CYAN 0x07FF
#endif
#include "esp_bt.h"
#include "ArchivoNarrow-Medium10.h"
#include "orbitron-medium18.h"
#include "orbitron-medium8.h"
#include "esp_now_time_sync_types.h"

#define CHANNEL 1
#define MAX_SLAVES 10
/** Mẫu số dòng "IMU nodes: x / N" trên TFT (bài test hiện tại 5 node; chưa dùng /10). */
#define TFT_IMU_NODES_DISPLAY_MAX 5
/** Phải > HELLO_RECONNECT_INTERVAL slave (3 s) và thời gian chờ SYNC/TBURST. */
#define SLAVE_RX_TIMEOUT_MS 5000UL
/** Trung bình trượt RSSI (số mẫu); hiển thị TFT chỉ cập nhật mỗi SLAVE_RSSI_TFT_INTERVAL_MS. */
#define SLAVE_RSSI_MA_N 10
#define SLAVE_RSSI_TFT_INTERVAL_MS 3000UL
#define USE_LONG_RANGE 1
/** esp_wifi_set_max_tx_power: đơn vị 0,25 dBm; ESP32 thường 8…84 (≈2…21 dBm). Tối thiểu = 8. */
#define MAX_TX_POWER 8
#ifndef MASTER_WIFI_TX_POWER_ADAPTIVE
#define MASTER_WIFI_TX_POWER_ADAPTIVE 1
#endif
#ifndef MASTER_WIFI_TX_POWER_NORM_QDB
#define MASTER_WIFI_TX_POWER_NORM_QDB MAX_TX_POWER
#endif
#ifndef MASTER_WIFI_TX_POWER_BOOST_QDB
#define MASTER_WIFI_TX_POWER_BOOST_QDB 84
#endif
#ifndef MASTER_WIFI_TX_RSSI_BOOST_DB
#define MASTER_WIFI_TX_RSSI_BOOST_DB (-75)
#endif
#ifndef MASTER_WIFI_TX_RSSI_RESTORE_DB
#define MASTER_WIFI_TX_RSSI_RESTORE_DB (-65)
#endif
#ifndef MASTER_WIFI_TX_POWER_ADJ_INTERVAL_MS
#define MASTER_WIFI_TX_POWER_ADJ_INTERVAL_MS 2000U
#endif

/** Số mẫu tối đa mỗi gói IMU_LOST (chia nhỏ nếu thiếu dài). */
#ifndef MASTER_IMU_LOST_MAX_CHUNK
#define MASTER_IMU_LOST_MAX_CHUNK 32U
#endif
/**
 * 1 = phát hiện lỗ hổng seq IMU → gửi IMU_LOST cho slave truyền lại (+ timeout poll).
 * 0 = tắt tạm, không request retx (lọc Serial: MASTER_SERIAL_SEQ_FILTER).
 */
#ifndef MASTER_IMU_LOST_REQUEST_ENABLE
#define MASTER_IMU_LOST_REQUEST_ENABLE 0
#endif

/**
 * 1 = lọc trùng / reorder sample_seq (theo MAC) trước khi gửi UART tới PC.
 * 0 = gửi hết mọi mẫu nhận được (IMU + VL53), không bỏ mẫu theo seq.
 */
#ifndef MASTER_SERIAL_SEQ_FILTER
#define MASTER_SERIAL_SEQ_FILTER 0
#endif

/** Pin 1 cell Li-ion: đầy / cạn (V tại cell). % = nội suy theo Vcell (Vadc sau cầu × 2). */
#define VBAT_CELL_FULL_V 4.1f
#define VBAT_CELL_EMPTY_V 3.2f
/** Cầu chia: Vadc tại chân = Vcell × scale (0.5 → Vcell = Vadc / scale). */
#define VBAT_ADC_PIN_VCELL_SCALE 0.496f
#define VBAT_ADC_PIN_AT_CELL_FULL_V (VBAT_CELL_FULL_V * VBAT_ADC_PIN_VCELL_SCALE)
#define VBAT_ADC_REF_V 3.3f
#define VBAT_VCELL_PER_VADC (VBAT_CELL_FULL_V / VBAT_ADC_PIN_AT_CELL_FULL_V)

// 1: Serial gửi khung nhị phân (sync 4 byte + payload raw + CRC16 LE) cho PC/logger; 0: dòng chữ IMU,...
#define IMU_SERIAL_BINARY 1

#define TFT_WIDTH   240
#define TFT_HEIGHT  320
#define TFT_CS      5
#define TFT_DC      2
#define TFT_RST     4
#define TFT_LED     15
#define TFT_SPI_HZ  70000000UL

#define LEDC_FREQ     5000
#define LEDC_RES      8

Adafruit_ST7789 tft = Adafruit_ST7789(TFT_CS, TFT_DC, TFT_RST);

static void uiFont() {
  tft.setFont(&ArchivoNarrow_Medium10pt7b);
  tft.setTextSize(1);
}

// Adafruit_GFX cũ / ST7789: không có fontHeight(); dùng yAdvance trong GFXfont (Archivo 10pt = 26)
static uint16_t uiFontLineHeight() {
  return (uint16_t)ArchivoNarrow_Medium10pt7b.yAdvance;
}

// setCursor(x,y) với font GFX là baseline; y1 từ getTextBounds thường âm (phần chữ phía trên baseline)
static int16_t uiFirstBaselineY(int16_t marginTopPx) {
  int16_t x1, y1;
  uint16_t w, h;
  tft.getTextBounds("Ay", 0, 0, &x1, &y1, &w, &h);
  return (int16_t)(marginTopPx - y1);
}

/**
 * Xóa một dòng dùng font UI: getTextBounds + padding giống erase text cũ, nhưng
 * fill full chiều ngang màn hình (RSSI/%, cột bên phải không bị sót).
 */
static void tftEraseUIRowAtBaseline(
    int16_t baselineY, const char *measureText) {
  if (!measureText || !measureText[0]) {
    return;
  }
  uiFont();
  int16_t x1, y1;
  uint16_t w, h;
  tft.getTextBounds(measureText, 4, baselineY, &x1, &y1, &w, &h);
  x1 -= 2;
  y1 -= 2;
  w += 4;
  h += 4;
  (void)w;
  if (x1 < 0) {
    x1 = 0;
  }
  if (y1 < 0) {
    y1 = 0;
  }
  if (h < 1) {
    return;
  }
  if ((int32_t)y1 + (int32_t)h > (int32_t)tft.height()) {
    h = (uint16_t)((int32_t)tft.height() - (int32_t)y1);
  }
  if (h < 1) {
    return;
  }
  tft.fillRect(0, y1, (int16_t)tft.width(), h, ST77XX_BLACK);
}

/** Bbox xóa tối thiểu nếu chưa có s_prev. */
static const char kTftMeasureMacLine[] = "MAC: 000000000000";
static const char kTftMeasureSlavesLine[] = "IMU nodes: 00 / 00";
static const char kTftMeasureSlaveRow[] = "10. AABB -100 dBm 100%";

/** Căn cột (LCD 240px, Archivo 10pt); không vẽ viền bảng. */
static const int16_t kTftSlaveColIdx = 4;
static const int16_t kTftSlaveColMac = 32;
static const int16_t kTftSlaveColRssi = 86;
static const int16_t kTftSlaveColBat = 168;

// Khớp scale trên Slave (imu_logger / imu_serial_codec.py)
#define IMU_RAW_ACC_SCALE 512.0f
#define IMU_GYRO_FS_DPS 2000.0f
#define IMU_RAW_GYRO_SCALE (32767.0f / IMU_GYRO_FS_DPS)
#define IMU_TEMP_CENTI_SCALE 100.0f

static MacSeqTrack g_macSeqTrack[MASTER_MAC_SEQ_TRACK];
static uint8_t g_macSeqTrackCount = 0;

static MacSeqTrack *masterMacSeqFindOrAdd(const uint8_t *mac) {
  for (uint8_t i = 0; i < g_macSeqTrackCount; i++) {
    if (memcmp(g_macSeqTrack[i].mac, mac, 6) == 0) {
      return &g_macSeqTrack[i];
    }
  }
  if (g_macSeqTrackCount < MASTER_MAC_SEQ_TRACK) {
    MacSeqTrack *p = &g_macSeqTrack[g_macSeqTrackCount++];
    memcpy(p->mac, mac, 6);
    p->imu_inited = false;
    p->imu_last = 0U;
    p->vl53_inited = false;
    p->vl53_last = 0U;
    return p;
  }
  return NULL;
}

static bool masterSeqStreamShouldForward(bool *inited, uint32_t *last, uint32_t seq) {
  if (!*inited) {
    *inited = true;
    *last = seq;
    return true;
  }
  uint32_t delta = (seq - *last) & 0xFFFFFFFFU;
  if (delta == 0) {
    return false;
  }
  if (delta == 1) {
    *last = seq;
    return true;
  }
  if (delta > 0x7FFFFFFFU) {
    uint32_t backward = (*last - seq) & 0xFFFFFFFFU;
    if (backward <= MASTER_SEQ_REORDER_BACK_MAX) {
      return false;
    }
    *last = seq;
    return true;
  }
  if (delta > MASTER_SEQ_RESET_THRESHOLD) {
    *last = seq;
    return true;
  }
  *last = seq;
  return true;
}

static void masterSendImuLostForGap(MacSeqTrack *t, uint32_t seq_first, uint32_t nmiss, uint32_t node_id);
static void masterImuRetxMarkSample(const uint8_t *mac, uint32_t seq);
static void masterImuRetxTimeoutPoll(void);

static bool imuStreamAllowForwardAndRequestLost(MacSeqTrack *t, uint32_t node_id, uint32_t seq) {
  if (!t) {
    return true;
  }
  if (t->imu_inited) {
    uint32_t last = t->imu_last;
    uint32_t delta = (seq - last) & 0xFFFFFFFFU;
#if MASTER_IMU_LOST_REQUEST_ENABLE
    if (delta > 1U && delta < 0x7FFFFFFFU && delta <= MASTER_SEQ_RESET_THRESHOLD) {
      masterSendImuLostForGap(t, last + 1U, delta - 1U, node_id);
    }
#endif
  }
  return masterSeqStreamShouldForward(&t->imu_inited, &t->imu_last, seq);
}

static bool imuSerialShouldForwardWithNode(const uint8_t *mac, uint32_t node_id, uint32_t seq) {
  MacSeqTrack *t = masterMacSeqFindOrAdd(mac);
  return imuStreamAllowForwardAndRequestLost(t, node_id, seq);
}

