caonam-tugraz/MultiIMU-GaitSync/firmware/master_tft/ESP32_ESP_NOW_TIME_SYNC_MASTER_TFT_2_0/ESP32_ESP_NOW_TIME_SYNC_MASTER_TFT_2_0.ino
static bool vl53SerialShouldForward(const uint8_t *mac, uint32_t seq) {
  MacSeqTrack *t = masterMacSeqFindOrAdd(mac);
  if (!t) {
    return true;
  }
  return masterSeqStreamShouldForward(&t->vl53_inited, &t->vl53_last, seq);
}

static inline int16_t masterFloatToI16(float v, float scale) {
  float x = roundf(v * scale);
  if (x > 32767.0f) return 32767;
  if (x < -32768.0f) return -32768;
  return (int16_t)x;
}

static void serialWriteImuRawFrameImpl(imu_packet_raw_t raw) {
  raw.master_micros_at_tx = nowUs();
  static const uint8_t kImuSync[] = {0xA5, 0x5A, 0xA5, 0x5A};
  Serial.write(kImuSync, sizeof(kImuSync));
  Serial.write((const uint8_t *)&raw, sizeof(raw));
  uint16_t crc = imu_serial_crc16_ccitt_false((const uint8_t *)&raw, sizeof(raw));
  Serial.write((uint8_t)(crc & 0xFF));
  Serial.write((uint8_t)((crc >> 8) & 0xFF));
}

/** Gửi IMU ra PC; tuỳ MASTER_SERIAL_SEQ_FILTER có lọc trùng seq hay gửi hết. */
static void serialWriteImuRawFrame(const imu_packet_raw_t &raw) {
#if MASTER_SERIAL_SEQ_FILTER
  if (!imuSerialShouldForwardWithNode(raw.mac, raw.node_id, raw.sample_seq)) {
    return;
  }
#endif
  serialWriteImuRawFrameImpl(raw);
}

// UART raw VL53: sync khác IMU để PC tách khung; payload = vl53_packet_t (packed, khớp esp_now_time_sync_types.h)
static void serialWriteVl53RawFrame(const vl53_packet_t &v) {
#if MASTER_SERIAL_SEQ_FILTER
  if (!vl53SerialShouldForward(v.mac, v.sample_seq)) {
    return;
  }
#endif
  static const uint8_t kVl53Sync[] = {0xB5, 0x5B, 0xB5, 0x5B};
  Serial.write(kVl53Sync, sizeof(kVl53Sync));
  Serial.write((const uint8_t *)&v, sizeof(v));
  uint16_t crc = imu_serial_crc16_ccitt_false((const uint8_t *)&v, sizeof(v));
  Serial.write((uint8_t)(crc & 0xFF));
  Serial.write((uint8_t)((crc >> 8) & 0xFF));
}

static imu_packet_raw_t floatImuPacketToRaw(const imu_packet_t &imu) {
  imu_packet_raw_t raw = {};
  memcpy(raw.type, "IMU_RAW\0", 8);
  memcpy(raw.mac, imu.mac, 6);
  raw.node_id = imu.node_id;
  raw.micros_timestamp = imu.micros_timestamp;
  raw.sample_seq = 0;
  raw.ax = masterFloatToI16(imu.ax, IMU_RAW_ACC_SCALE);
  raw.ay = masterFloatToI16(imu.ay, IMU_RAW_ACC_SCALE);
  raw.az = masterFloatToI16(imu.az, IMU_RAW_ACC_SCALE);
  raw.gx = masterFloatToI16(imu.gx, IMU_RAW_GYRO_SCALE);
  raw.gy = masterFloatToI16(imu.gy, IMU_RAW_GYRO_SCALE);
  raw.gz = masterFloatToI16(imu.gz, IMU_RAW_GYRO_SCALE);
  raw.mx = 0;
  raw.my = 0;
  raw.mz = 0;
  raw.temp_centi_c = 0;
  return raw;
}

static uint64_t masterImuBatchEndMicros(const imu_batch_packet_t &pkt) {
  uint64_t t = pkt.micros_t0;
  for (uint32_t i = 1; i < pkt.count; i++) {
    t += pkt.rest[i - 1].delta_us_from_prev;
  }
  return t;
}

static uint64_t masterVl53BatchEndMicros(const vl53_batch_packet_t &pkt) {
  uint64_t t = pkt.micros_t0;
  for (uint32_t i = 1; i < pkt.count; i++) {
    t += pkt.rest[i - 1].delta_us_from_prev;
  }
  return t;
}

// Slave gửi IMU_RAWB: nhiều mẫu trong một gói ESP-NOW → tách ra nhiều khung Serial (IMU_RAW + imu_packet_raw_t).
static bool tryExpandImuBatchToSerial(const uint8_t *data, int len, uint64_t rxUs) {
  if (len < (int)IMU_BATCH_HEADER_SIZE) {
    return false;
  }
  imu_batch_packet_t pkt = {};
  size_t copy_len = (size_t)len;
  if (copy_len > sizeof(pkt)) {
    copy_len = sizeof(pkt);
  }
  memcpy(&pkt, data, copy_len);
  if (memcmp(pkt.type, "IMU_RAWB", 8) != 0) {
    return false;
  }
  if (pkt.count < 1 || pkt.count > IMU_BATCH_MAX_SAMPLES) {
    return false;
  }
  int expected =
      (int)(IMU_BATCH_HEADER_SIZE +
            (size_t)(pkt.count - 1U) * sizeof(imu_batch_delta_t));
  if (len != expected) {
    return false;
  }

  imu_packet_raw_t raw = {};
  memcpy(raw.type, "IMU_RAW\0", 8);
  memcpy(raw.mac, pkt.mac, 6);
  raw.node_id = pkt.node_id;
  raw.micros_timestamp = pkt.micros_t0;
  raw.sample_seq = pkt.sample_seq0;
  raw.ax = pkt.ax0;
  raw.ay = pkt.ay0;
  raw.az = pkt.az0;
  raw.gx = pkt.gx0;
  raw.gy = pkt.gy0;
  raw.gz = pkt.gz0;
  raw.mx = pkt.mx0;
  raw.my = pkt.my0;
  raw.mz = pkt.mz0;
  raw.temp_centi_c = pkt.temp_centi_c;
  masterImuRetxMarkSample(raw.mac, raw.sample_seq);
  serialWriteImuRawFrame(raw);

  uint64_t t = pkt.micros_t0;
  for (uint32_t i = 1; i < pkt.count; i++) {
    t += pkt.rest[i - 1].delta_us_from_prev;
    raw.micros_timestamp = t;
    raw.sample_seq = pkt.sample_seq0 + i;
    raw.ax = pkt.rest[i - 1].ax;
    raw.ay = pkt.rest[i - 1].ay;
    raw.az = pkt.rest[i - 1].az;
    raw.gx = pkt.rest[i - 1].gx;
    raw.gy = pkt.rest[i - 1].gy;
    raw.gz = pkt.rest[i - 1].gz;
    raw.mx = pkt.rest[i - 1].mx;
    raw.my = pkt.rest[i - 1].my;
    raw.mz = pkt.rest[i - 1].mz;
    raw.temp_centi_c = pkt.temp_centi_c;
    masterImuRetxMarkSample(raw.mac, raw.sample_seq);
    serialWriteImuRawFrame(raw);
  }
  return true;
}

// Slave gửi IMU_RETXB: cùng layout IMU_RAWB — ghi Serial không lọc seq (gửi lại mẫu thiếu).
static bool tryExpandImuRtxBatchToSerial(const uint8_t *data, int len, uint64_t rxUs) {
  if (len < (int)IMU_BATCH_HEADER_SIZE) {
    return false;
  }
  imu_batch_packet_t pkt = {};
  size_t copy_len = (size_t)len;
  if (copy_len > sizeof(pkt)) {
    copy_len = sizeof(pkt);
  }
  memcpy(&pkt, data, copy_len);
  if (memcmp(pkt.type, "IMU_RTXB", 8) != 0) {
    return false;
  }
  if (pkt.count < 1 || pkt.count > IMU_BATCH_MAX_SAMPLES) {
    return false;
  }
  int expected =
      (int)(IMU_BATCH_HEADER_SIZE +
            (size_t)(pkt.count - 1U) * sizeof(imu_batch_delta_t));
  if (len != expected) {
    return false;
  }

  imu_packet_raw_t raw = {};
  memcpy(raw.type, "IMU_RAW\0", 8);
  memcpy(raw.mac, pkt.mac, 6);
  raw.node_id = pkt.node_id;
  raw.micros_timestamp = pkt.micros_t0;
  raw.sample_seq = pkt.sample_seq0;
  raw.ax = pkt.ax0;
  raw.ay = pkt.ay0;
  raw.az = pkt.az0;
  raw.gx = pkt.gx0;
  raw.gy = pkt.gy0;
  raw.gz = pkt.gz0;
  raw.mx = pkt.mx0;
  raw.my = pkt.my0;
  raw.mz = pkt.mz0;
  raw.temp_centi_c = pkt.temp_centi_c;
  masterImuRetxMarkSample(raw.mac, raw.sample_seq);
  serialWriteImuRawFrameImpl(raw);

  uint64_t t = pkt.micros_t0;
  for (uint32_t i = 1; i < pkt.count; i++) {
    t += pkt.rest[i - 1].delta_us_from_prev;
    raw.micros_timestamp = t;
    raw.sample_seq = pkt.sample_seq0 + i;
    raw.ax = pkt.rest[i - 1].ax;
    raw.ay = pkt.rest[i - 1].ay;
    raw.az = pkt.rest[i - 1].az;
    raw.gx = pkt.rest[i - 1].gx;
    raw.gy = pkt.rest[i - 1].gy;
    raw.gz = pkt.rest[i - 1].gz;
    raw.mx = pkt.rest[i - 1].mx;
    raw.my = pkt.rest[i - 1].my;
    raw.mz = pkt.rest[i - 1].mz;
    raw.temp_centi_c = pkt.temp_centi_c;
    masterImuRetxMarkSample(raw.mac, raw.sample_seq);
    serialWriteImuRawFrameImpl(raw);
  }
  Serial.printf(
      "IMU_LOG,LOST_RTX,%02X:%02X:%02X:%02X:%02X:%02X,%lu,%u,%lu\n",
      pkt.mac[0], pkt.mac[1], pkt.mac[2], pkt.mac[3], pkt.mac[4], pkt.mac[5],
      (unsigned long)pkt.node_id, (unsigned)pkt.count, (unsigned long)pkt.sample_seq0);
  return true;
}

