caonam-tugraz/MultiIMU-GaitSync/firmware/master_tft/ESP32_ESP_NOW_TIME_SYNC_MASTER_TFT_2_0/ESP32_ESP_NOW_TIME_SYNC_MASTER_TFT_2_0.ino
// Slave gửi VL53RAWB: nhiều mẫu trong một gói → Serial từng mẫu (text hoặc khung B5+66 byte).
static bool tryExpandVl53BatchToSerial(const uint8_t *data, int len, uint64_t rxUs) {
  if (len < (int)VL53_BATCH_HEADER_SIZE) {
    return false;
  }
  vl53_batch_packet_t pkt = {};
  size_t copy_len = (size_t)len;
  if (copy_len > sizeof(pkt)) {
    copy_len = sizeof(pkt);
  }
  memcpy(&pkt, data, copy_len);
  if (memcmp(pkt.type, "VL53RAWB", 8) != 0) {
    return false;
  }
  if (pkt.count < 1 || pkt.count > VL53_BATCH_MAX_SAMPLES) {
    return false;
  }
  int expected =
      (int)(VL53_BATCH_HEADER_SIZE +
            (size_t)(pkt.count - 1U) * sizeof(vl53_batch_delta_t));
  if (len != expected) {
    return false;
  }

  uint64_t t = pkt.micros_t0;
  for (uint32_t i = 0; i < pkt.count; i++) {
    if (i > 0) {
      t += pkt.rest[i - 1].delta_us_from_prev;
    }
    uint32_t seq = pkt.sample_seq0 + i;
    const int16_t *zones =
        (i == 0) ? pkt.d0 : pkt.rest[i - 1].distance_raw;
#if IMU_SERIAL_BINARY
    vl53_packet_t v = {};
    memcpy(v.type, "VL53\0\0\0\0", 8);
    memcpy(v.mac, pkt.mac, 6);
    v.node_id = pkt.node_id;
    v.timestamp = (uint32_t)(t / 1000ULL);
    v.micros_timestamp = t;
    v.sample_seq = seq;
    memcpy(v.distance_raw, zones, sizeof(v.distance_raw));
    serialWriteVl53RawFrame(v);
#else
#if MASTER_SERIAL_SEQ_FILTER
    if (!vl53SerialShouldForward(pkt.mac, seq)) {
      continue;
    }
#endif
    Serial.printf("VL53,%02X:%02X:%02X:%02X:%02X:%02X,%lu,%llu,%lu",
                  pkt.mac[0], pkt.mac[1], pkt.mac[2], pkt.mac[3], pkt.mac[4],
                  pkt.mac[5], (unsigned long)(t / 1000ULL),
                  (unsigned long long)t, (unsigned long)seq);
    for (int z = 0; z < VL53_ZONE_COUNT; z++) {
      Serial.printf(",%d", (int)zones[z]);
    }
    Serial.println();
#endif
  }
  return true;
}

uint8_t slaveList[MAX_SLAVES][6];
uint32_t slaveLastSeenMs[MAX_SLAVES];
uint64_t slaveLastSyncUs[MAX_SLAVES];
uint32_t slaveLastSyncRttUs[MAX_SLAVES];
int8_t slaveLastRssi[MAX_SLAVES];
bool slaveRssiValid[MAX_SLAVES];
int8_t slaveRssiWin[MAX_SLAVES][SLAVE_RSSI_MA_N];
uint8_t slaveRssiWinN[MAX_SLAVES];
uint8_t slaveRssiWinPos[MAX_SLAVES];
uint8_t slaveLastBatPct[MAX_SLAVES];
bool slaveBatValid[MAX_SLAVES];
/** Điện áp cell (sau khi nhân 2 so với V tại chân ADC), dùng hiển thị TFT. */
float slaveLastVcell[MAX_SLAVES];
int slaveCount = 0;

/** Điện áp tại chân ADC sau cầu (chia 2), từ raw 12-bit. */
static float adcRawToVadcPin(uint16_t raw12) {
  return (float)raw12 * (VBAT_ADC_REF_V / 4095.0f);
}

/** Điện áp cell = Vadc × (1/scale) = Vadc × VBAT_VCELL_PER_VADC. */
static float adcRawToVcellEst(uint16_t raw12) {
  return adcRawToVadcPin(raw12) * VBAT_VCELL_PER_VADC;
}

/** % pin theo điện áp cell 3.5V…4.1V (100% tại 4.1V). */
static uint8_t adcRawToBatteryPct(uint16_t raw12) {
  const float Vcell = adcRawToVcellEst(raw12);
  if (Vcell >= VBAT_CELL_FULL_V) {
    return 100;
  }
  if (Vcell <= VBAT_CELL_EMPTY_V) {
    return 0;
  }
  float pct =
      (Vcell - VBAT_CELL_EMPTY_V) / (VBAT_CELL_FULL_V - VBAT_CELL_EMPTY_V) * 100.0f;
  if (pct > 100.0f) {
    pct = 100.0f;
  }
  if (pct < 0.0f) {
    pct = 0.0f;
  }
  return (uint8_t)(pct + 0.5f);
}

static uint16_t batPinPctColor(uint8_t pct) {
  if (pct < 10) {
    return ST77XX_RED;
  }
  if (pct > 65) {
    return ST77XX_GREEN;
  }
  return ST77XX_YELLOW;
}

/**
 * dBm: giá trị càng ít âm = sóng càng mạnh (ví dụ -40 tốt hơn -80). Càng âm = càng yếu.
 * Ngưỡng tương đối cho WiFi 2.4 GHz; chỉ dùng khi đã có mẫu RSSI hợp lệ.
 */
static uint16_t rssiDbmTextColor(int8_t dbm) {
  if (dbm >= -50) {
    return ST77XX_GREEN;
  }
  if (dbm >= -62) {
    return ST77XX_YELLOW;
  }
  if (dbm >= -75) {
    return ST77XX_ORANGE;
  }
  return ST77XX_RED;
}

/**
 * Một dòng slave: căn cột #, MAC (2 byte), RSSI, %% pin (không vẽ viền).
 * fullLineNoSync: chỉ dùng so sánh snapshot (và khi chưa sync vẽ từ buffer tương đương).
 */
static void tftPrintSlaveRowColored(int16_t x, int16_t baselineY, int i,
                                    const char *fullLineNoSync) {
  (void)x;
  (void)fullLineNoSync;
  uiFont();
  char idxStr[6];
  snprintf(idxStr, sizeof(idxStr), "%2d.", i + 1);
  char mac4[8];
  snprintf(mac4, sizeof(mac4), "%02X%02X", slaveList[i][4], slaveList[i][5]);

  if (slaveLastSyncUs[i] == 0ULL) {
    tft.setTextColor(ST77XX_DARKGREY);
    tft.setCursor(kTftSlaveColIdx, baselineY);
    tft.print(idxStr);
    tft.setCursor(kTftSlaveColMac, baselineY);
    tft.print(mac4);
    return;
  }

  tft.setTextColor(ST77XX_WHITE);
  tft.setCursor(kTftSlaveColIdx, baselineY);
  tft.print(idxStr);
  tft.setCursor(kTftSlaveColMac, baselineY);
  tft.print(mac4);

  char rssiStr[16];
  if (slaveRssiValid[i]) {
    tft.setTextColor(rssiDbmTextColor(slaveLastRssi[i]));
    snprintf(rssiStr, sizeof(rssiStr), "%d dBm", (int)slaveLastRssi[i]);
  } else {
    tft.setTextColor(ST77XX_DARKGREY);
    snprintf(rssiStr, sizeof(rssiStr), "-- dBm");
  }
  tft.setCursor(kTftSlaveColRssi, baselineY);
  tft.print(rssiStr);

  tft.setCursor(kTftSlaveColBat, baselineY);
  if (slaveBatValid[i]) {
    tft.setTextColor(batPinPctColor(slaveLastBatPct[i]));
    char pb[8];
    snprintf(pb, sizeof(pb), "%u%%", (unsigned)slaveLastBatPct[i]);
    tft.print(pb);
  } else {
    tft.setTextColor(ST77XX_DARKGREY);
    tft.print("--%");
  }
}

static int slaveIndexForMac(const uint8_t *mac) {
  for (int i = 0; i < slaveCount; i++) {
    if (memcmp(mac, slaveList[i], 6) == 0) {
      return i;
    }
  }
  return -1;
}

static void slaveRssiPushSample(int si, int8_t r) {
  if (si < 0 || si >= slaveCount) {
    return;
  }
  if (slaveRssiWinN[si] < SLAVE_RSSI_MA_N) {
    slaveRssiWin[si][slaveRssiWinN[si]++] = r;
  } else {
    slaveRssiWin[si][slaveRssiWinPos[si]] = r;
    slaveRssiWinPos[si] =
        (uint8_t)((slaveRssiWinPos[si] + 1U) % (uint8_t)SLAVE_RSSI_MA_N);
  }
}

/** Cập nhật slaveLastRssi / slaveRssiValid từ cửa sổ MA (gọi khi sắp vẽ TFT, ~3s một lần). */
static void updateSlaveRssiDisplayFromWindows(void) {
  for (int i = 0; i < slaveCount; i++) {
    const uint8_t n = slaveRssiWinN[i];
    if (n == 0U) {
      slaveRssiValid[i] = false;
      continue;
    }
    int32_t sum = 0;
    if (n < (uint8_t)SLAVE_RSSI_MA_N) {
      for (uint8_t k = 0; k < n; k++) {
        sum += (int32_t)slaveRssiWin[i][k];
      }
      slaveLastRssi[i] = (int8_t)((sum + (int32_t)n / 2) / (int32_t)n);
    } else {
      for (uint8_t k = 0; k < (uint8_t)SLAVE_RSSI_MA_N; k++) {
        sum += (int32_t)slaveRssiWin[i][k];
      }
      slaveLastRssi[i] = (int8_t)((sum + 5) / 10);
    }
    slaveRssiValid[i] = true;
  }
}

