caonam-tugraz/MultiIMU-GaitSync/firmware/master_tft/ESP32_ESP_NOW_TIME_SYNC_MASTER_TFT_2_0/ESP32_ESP_NOW_TIME_SYNC_MASTER_TFT_2_0.ino
#if MASTER_WIFI_TX_POWER_ADAPTIVE
static int8_t s_masterWifiTxQdb = 0;
static bool s_masterWifiTxBoosted = false;
static uint32_t s_masterWifiTxLastAdjMs = 0;

static int8_t masterWifiClampTxQdb(int8_t qdb) {
  if (qdb < 8) {
    return 8;
  }
  if (qdb > 84) {
    return 84;
  }
  return qdb;
}

static bool masterWifiApplyTxPowerQdb(int8_t qdb) {
  qdb = masterWifiClampTxQdb(qdb);
  if (qdb == s_masterWifiTxQdb) {
    return false;
  }
  const esp_err_t e = esp_wifi_set_max_tx_power(qdb);
  if (e != ESP_OK) {
    return false;
  }
  s_masterWifiTxQdb = qdb;
  return true;
}

static void masterWifiTxPowerInit(void) {
  s_masterWifiTxBoosted = false;
  if (masterWifiApplyTxPowerQdb((int8_t)MASTER_WIFI_TX_POWER_NORM_QDB)) {
    Serial.printf("[LINK] Master TX init: quarter-dBm=%d (~%.1f dBm)\n",
                  (int)s_masterWifiTxQdb, (double)s_masterWifiTxQdb * 0.25);
  }
}

static void masterWifiTxPowerUpdateFromRssi(int8_t rssiDb) {
  const uint32_t now = millis();
  if (s_masterWifiTxLastAdjMs != 0U &&
      (uint32_t)(now - s_masterWifiTxLastAdjMs) < MASTER_WIFI_TX_POWER_ADJ_INTERVAL_MS) {
    return;
  }

  bool wantBoost;
  if (rssiDb < (int8_t)MASTER_WIFI_TX_RSSI_BOOST_DB) {
    wantBoost = true;
  } else if (rssiDb >= (int8_t)MASTER_WIFI_TX_RSSI_RESTORE_DB) {
    wantBoost = false;
  } else {
    return;
  }

  if (wantBoost == s_masterWifiTxBoosted) {
    return;
  }

  const int8_t target = wantBoost ? (int8_t)MASTER_WIFI_TX_POWER_BOOST_QDB
                                  : (int8_t)MASTER_WIFI_TX_POWER_NORM_QDB;
  if (!masterWifiApplyTxPowerQdb(target)) {
    return;
  }
  s_masterWifiTxBoosted = wantBoost;
  s_masterWifiTxLastAdjMs = now;
  Serial.printf("[LINK] Master TX %s: quarter-dBm=%d (~%.1f dBm), min RSSI=%d dBm\n",
                wantBoost ? "BOOST" : "NORM", (int)target, (double)target * 0.25,
                (int)rssiDb);
}

static void masterWifiTxPowerRecomputeFromSlaves(void) {
  if (slaveCount <= 0) {
    return;
  }
  updateSlaveRssiDisplayFromWindows();
  int8_t minRssi = 127;
  bool any = false;
  for (int i = 0; i < slaveCount; i++) {
    if (!slaveRssiValid[i]) {
      continue;
    }
    any = true;
    if (slaveLastRssi[i] < minRssi) {
      minRssi = slaveLastRssi[i];
    }
  }
  if (any) {
    masterWifiTxPowerUpdateFromRssi(minRssi);
  }
}
#endif

static void noteSlaveRssiIfKnown(const esp_now_recv_info *info, const uint8_t *src) {
  if (!info || !info->rx_ctrl) {
    return;
  }
  int si = slaveIndexForMac(src);
  if (si < 0) {
    return;
  }
  slaveRssiPushSample(si, (int8_t)info->rx_ctrl->rssi);
#if MASTER_WIFI_TX_POWER_ADAPTIVE
  masterWifiTxPowerRecomputeFromSlaves();
#endif
}

unsigned long lastPrint = 0;
int masterTimezone = 7; // GMT+7

// Không vẽ TFT trong callback ESP-NOW (ensureSlavePeer / …): chỉ gắn cờ, loop() mới vẽ — ưu tiên serial + tránh chặn WiFi task.
static volatile bool g_tftRefreshPending = false;

static inline void requestTftRefresh() {
  g_tftRefreshPending = true;
}

char serialLineBuf[192];
size_t serialLineLen = 0;

uint64_t nowUs() {
  return (uint64_t)esp_timer_get_time();
}

uint32_t nowMs() {
  return (uint32_t)(nowUs() / 1000ULL);
}

void printMAC(const uint8_t *mac) {
  for (int i = 0; i < 6; i++) {
    Serial.printf("%02X", mac[i]);
    if (i < 5) Serial.print(":");
  }
}

String macToString(const uint8_t *mac) {
  char buf[18];
  snprintf(buf, sizeof(buf), "%02X:%02X:%02X:%02X:%02X:%02X",
           mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  return String(buf);
}

bool parseMacString(const char *text, uint8_t *mac) {
  unsigned int values[6];
  if (sscanf(text, "%2x:%2x:%2x:%2x:%2x:%2x",
             &values[0], &values[1], &values[2],
             &values[3], &values[4], &values[5]) != 6) {
    return false;
  }
  for (int i = 0; i < 6; i++) {
    mac[i] = (uint8_t)values[i];
  }
  return true;
}

void printSlaveList() {
  Serial.println("\n📋 Danh sách slave hiện tại:");
  if (slaveCount == 0) {
    Serial.println("   (Chưa có thiết bị nào)");
    return;
  }

  for (int i = 0; i < slaveCount; i++) {
    Serial.printf("   #%d: ", i + 1);
    printMAC(slaveList[i]);
    Serial.println();
  }

  Serial.printf("→ Tổng số slave: %d\n", slaveCount);
  Serial.println("----------------------------------");
}

void clearFullScreen() {
  tft.fillRect(0, 0, TFT_WIDTH, TFT_HEIGHT, ST77XX_BLACK);
  tft.fillRect(0, 0, tft.width(), tft.height(), ST77XX_BLACK);
  tft.fillRect(0, 0, TFT_WIDTH, TFT_HEIGHT, ST77XX_BLACK);
}

void drawMasterStatusScreen() {
  static const char kTitleImu[] = "IMU";
  static const char kTitleTail[] = "RECODER";
  const int16_t kTitleGap = 9;
  static bool s_snapValid;
  static int16_t s_prevLineStep;
  static int16_t s_prevFirstY;
  static int s_prevSlavesToShow;
  static int s_prevSnapSlaveCount;
  static int s_prevNSlaveRows;
  static bool s_prevHadOverflow;
  static char s_prevLineMac[48];
  static char s_prevLineSlaves[32];
  static char s_prevSlaveRow[MAX_SLAVES][72];
  static char s_prevOverflow[24];

  uint8_t mac[6];
#if ESP_IDF_VERSION_MAJOR >= 5
  esp_wifi_get_mac(WIFI_IF_STA, mac);
#else
  esp_read_mac(mac, ESP_MAC_WIFI_STA);
#endif

  uiFont();

  const uint16_t fontLineH = uiFontLineHeight();
  const int16_t marginTop = 4;
  const int16_t padBot = 4;
  const int16_t padDescender = 6;

  int16_t titleTy1;
  {
    int16_t x1i, y1i, x1r, y1r;
    uint16_t wi, hi, wr, hr;
    tft.setFont(&orbitron_medium18pt7b);
    tft.setTextSize(1);
    tft.getTextBounds(kTitleImu, 0, 0, &x1i, &y1i, &wi, &hi);
    tft.setFont(&orbitron_medium8pt7b);
    tft.getTextBounds(kTitleTail, 0, 0, &x1r, &y1r, &wr, &hr);
    titleTy1 = (y1i < y1r) ? y1i : y1r;
  }
  uiFont();
  const int16_t firstY = (int16_t)(marginTop - titleTy1);
  const int16_t lastBaselineMax = (int16_t)tft.height() - padBot - padDescender;
  int32_t spanBaselines = (int32_t)lastBaselineMax - (int32_t)firstY;
  if (spanBaselines < (int32_t)fontLineH) {
    spanBaselines = (int32_t)fontLineH;
  }

  const int headerLines = 3;
  const int16_t minStep = (int16_t)fontLineH;
  const int16_t maxStep = (int16_t)(fontLineH + 4);

  int slavesToShow = slaveCount;
  int totalLines = headerLines + slaveCount;

  int16_t lineStep = minStep;
  for (;;) {
    if (totalLines <= 1) {
      lineStep = minStep;
      break;
    }
    lineStep = (int16_t)(spanBaselines / (int32_t)(totalLines - 1));
    if (lineStep > maxStep) {
      lineStep = maxStep;
    }
    const bool fitsSpan = ((int32_t)lineStep * (int32_t)(totalLines - 1) <= spanBaselines);
    if (lineStep >= minStep && fitsSpan) {
      break;
    }
    if (slaveCount > 0 && slavesToShow > 1) {
      slavesToShow--;
      totalLines = headerLines + slavesToShow;
      continue;
    }
    lineStep = (int16_t)(spanBaselines / (int32_t)(totalLines - 1));
    if (lineStep > maxStep) {
      lineStep = maxStep;
    }
    if (lineStep < 1) {
      lineStep = 1;
    }
    break;
  }

  lineStep = (int16_t)((int32_t)lineStep / 2);
  lineStep = (int16_t)((int32_t)lineStep + 5);
  if (lineStep < 1) {
    lineStep = 1;
  }

  char macStr[16];
  snprintf(macStr, sizeof(macStr), "%02X%02X%02X%02X%02X%02X",
           mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);

  char line_mac[48];
  snprintf(line_mac, sizeof(line_mac), "MAC: %s", macStr);

  char line_slaves[32];
  snprintf(line_slaves, sizeof(line_slaves), "IMU nodes: %d / %d", slaveCount, TFT_IMU_NODES_DISPLAY_MAX);

  char slaveRows[MAX_SLAVES][72];
  int nSlaveRows = 0;
  char line_overflow[24] = "";
  const bool hasOverflow = (slaveCount > 0 && slavesToShow < slaveCount);

