caonam-tugraz/MultiIMU-GaitSync/firmware/master_tft/ESP32_ESP_NOW_TIME_SYNC_MASTER_TFT_2_0/ESP32_ESP_NOW_TIME_SYNC_MASTER_TFT_2_0.ino
  if (slaveCount > 0) {
    for (int i = 0; i < slavesToShow; i++) {
      if (slaveLastSyncUs[i] != 0ULL) {
        char rssiStr[20];
        if (slaveRssiValid[i]) {
          snprintf(rssiStr, sizeof(rssiStr), "%d dBm", (int)slaveLastRssi[i]);
        } else {
          snprintf(rssiStr, sizeof(rssiStr), "-- dBm");
        }
        if (slaveBatValid[i]) {
          snprintf(slaveRows[nSlaveRows++], sizeof(slaveRows[0]),
                   "%2d. %02X%02X | %s | %u%%", i + 1, slaveList[i][4],
                   slaveList[i][5], rssiStr, (unsigned)slaveLastBatPct[i]);
        } else {
          snprintf(slaveRows[nSlaveRows++], sizeof(slaveRows[0]),
                   "%2d. %02X%02X | %s | --%%", i + 1, slaveList[i][4],
                   slaveList[i][5], rssiStr);
        }
      } else {
        snprintf(slaveRows[nSlaveRows++], sizeof(slaveRows[0]), "%2d. %02X%02X",
                 i + 1, slaveList[i][4], slaveList[i][5]);
      }
    }
    if (hasOverflow) {
      snprintf(line_overflow, sizeof(line_overflow), "+%d slaves", slaveCount - slavesToShow);
    }
  }

  bool snapSame = s_snapValid &&
                  lineStep == s_prevLineStep && firstY == s_prevFirstY &&
                  slavesToShow == s_prevSlavesToShow && slaveCount == s_prevSnapSlaveCount &&
                  hasOverflow == s_prevHadOverflow &&
                  nSlaveRows == s_prevNSlaveRows;

  if (snapSame) {
    if (strcmp(line_mac, s_prevLineMac) != 0) {
      snapSame = false;
    }
    if (strcmp(line_slaves, s_prevLineSlaves) != 0) {
      snapSame = false;
    }
    if (slaveCount > 0) {
      for (int i = 0; i < nSlaveRows; i++) {
        if (strcmp(slaveRows[i], s_prevSlaveRow[i]) != 0) {
          snapSame = false;
          break;
        }
      }
      if (strcmp(line_overflow, s_prevOverflow) != 0) {
        snapSame = false;
      }
    }
  }

  if (snapSame) {
    return;
  }

  // Chỉ "full vùng nội dung" khi đổi bố cục cấu trúc (bước dòng, baseline, trống/overflow).
  // Không coi chỉ thay đổi số slave / dòng là layout — tránh clear cả màn → giật / nháy đen toàn màn.
  const bool structuralLayout =
      !s_snapValid ||
      lineStep != s_prevLineStep || firstY != s_prevFirstY ||
      hasOverflow != s_prevHadOverflow;

  if (structuralLayout) {
    if (s_snapValid) {
      int16_t yTop = firstY;
      if (s_prevFirstY < yTop) {
        yTop = s_prevFirstY;
      }
      if (yTop < 0) {
        yTop = 0;
      }
      tft.fillRect(0, yTop, tft.width(), tft.height() - yTop, ST77XX_BLACK);
    } else {
      clearFullScreen();
    }
    int16_t y = firstY;
    int16_t titleBot = firstY;
    {
      const int16_t marginXL = 4;
      int16_t x1i, y1i, x1r, y1r;
      uint16_t wi, hi, wr, hr;
      tft.setFont(&orbitron_medium18pt7b);
      tft.setTextSize(1);
      tft.getTextBounds(kTitleImu, 0, 0, &x1i, &y1i, &wi, &hi);
      tft.setFont(&orbitron_medium8pt7b);
      tft.getTextBounds(kTitleTail, 0, 0, &x1r, &y1r, &wr, &hr);
      int16_t spanImu = x1i + (int16_t)wi;
      int16_t xImu = marginXL - x1i;
      tft.setTextColor(ST77XX_ORANGE);
      tft.setFont(&orbitron_medium18pt7b);
      tft.setCursor(xImu, y);
      tft.print(kTitleImu);
      tft.setFont(&orbitron_medium8pt7b);
      tft.setCursor(xImu + spanImu + kTitleGap, y);
      tft.print(kTitleTail);
      int16_t tbx1, tby1;
      uint16_t tbw, tbh;
      tft.setFont(&orbitron_medium18pt7b);
      tft.getTextBounds(kTitleImu, xImu, firstY, &tbx1, &tby1, &tbw, &tbh);
      titleBot = tby1 + (int16_t)tbh;
      tft.setFont(&orbitron_medium8pt7b);
      tft.getTextBounds(kTitleTail, xImu + spanImu + kTitleGap, firstY, &tbx1, &tby1, &tbw, &tbh);
      int16_t t2 = tby1 + (int16_t)tbh;
      if (t2 > titleBot) {
        titleBot = t2;
      }
      uiFont();
    }
    {
      // 5px dưới đường kẻ (1px) rồi tới mép trên chữ MAC: my1 − 1 − 5
      const uint16_t kTitleRuleGray = 0xDEDB;
      const int16_t kGapPxAfterRuleBeforeMac = 10;
      uiFont();
      const int16_t macBaseline = firstY + lineStep;
      int16_t mx1, my1;
      uint16_t mw, mh;
      tft.getTextBounds(line_mac, 0, macBaseline, &mx1, &my1, &mw, &mh);
      int16_t yRule = my1 - 1 - kGapPxAfterRuleBeforeMac;
      if (yRule < titleBot + 1) {
        yRule = (int16_t)(titleBot + 1);
      }
      if (yRule < 0) {
        yRule = 0;
      }
      tft.drawFastHLine(4, yRule, tft.width() - 8, kTitleRuleGray);
    }
    y += lineStep;

    tft.setCursor(4, y);
    tft.setTextColor(ST77XX_WHITE);
    tft.print("MAC: ");
    tft.setTextColor(ST77XX_GREEN);
    tft.print(macStr);
    y += lineStep;

    tft.setTextColor(ST77XX_YELLOW);
    tft.setCursor(4, y);
    tft.print(line_slaves);
    y += lineStep;

    for (int i = 0; i < nSlaveRows; i++) {
      tftPrintSlaveRowColored(4, y, i, slaveRows[i]);
      y += lineStep;
    }
    if (line_overflow[0]) {
      tft.setCursor(4, y);
      tft.print(line_overflow);
    }
  } else {
    if (nSlaveRows < s_prevNSlaveRows) {
      for (int i = nSlaveRows; i < s_prevNSlaveRows; i++) {
        int16_t yErase = s_prevFirstY + s_prevLineStep * 3 + i * s_prevLineStep;
        const char *me =
            s_prevSlaveRow[i][0] ? s_prevSlaveRow[i] : kTftMeasureSlaveRow;
        tftEraseUIRowAtBaseline(yErase, me);
      }
      if (s_prevOverflow[0] && !line_overflow[0]) {
        int16_t yOv = s_prevFirstY + s_prevLineStep * 3 + s_prevNSlaveRows * s_prevLineStep;
        tftEraseUIRowAtBaseline(yOv, s_prevOverflow);
      }
    }
    int16_t y = firstY + lineStep;
    if (strcmp(line_mac, s_prevLineMac) != 0) {
      tftEraseUIRowAtBaseline(
          y, s_prevLineMac[0] ? s_prevLineMac : kTftMeasureMacLine);
      tft.setCursor(4, y);
      tft.setTextColor(ST77XX_WHITE);
      tft.print("MAC: ");
      tft.setTextColor(ST77XX_GREEN);
      tft.print(macStr);
    }
    y += lineStep;

    if (strcmp(line_slaves, s_prevLineSlaves) != 0) {
      tftEraseUIRowAtBaseline(
          y, s_prevLineSlaves[0] ? s_prevLineSlaves : kTftMeasureSlavesLine);
      tft.setTextColor(ST77XX_YELLOW);
      tft.setCursor(4, y);
      tft.print(line_slaves);
    }
    y += lineStep;

    for (int i = 0; i < nSlaveRows; i++) {
      if (strcmp(slaveRows[i], s_prevSlaveRow[i]) != 0) {
        const char *me = s_prevSlaveRow[i][0] ? s_prevSlaveRow[i]
                                               : kTftMeasureSlaveRow;
        tftEraseUIRowAtBaseline(y, me);
        tftPrintSlaveRowColored(4, y, i, slaveRows[i]);
      }
      y += lineStep;
    }
    if (strcmp(line_overflow, s_prevOverflow) != 0) {
      if (s_prevOverflow[0]) {
        tftEraseUIRowAtBaseline(y, s_prevOverflow);
      }
      if (line_overflow[0]) {
        tft.setTextColor(ST77XX_WHITE);
        tft.setCursor(4, y);
        tft.print(line_overflow);
      }
    }
  }

