caonam-tugraz/MultiIMU-GaitSync/firmware/master_tft/ESP32_ESP_NOW_TIME_SYNC_MASTER_TFT_2_0/ESP32_ESP_NOW_TIME_SYNC_MASTER_TFT_2_0.ino
  s_snapValid = true;
  s_prevLineStep = lineStep;
  s_prevFirstY = firstY;
  s_prevSlavesToShow = slavesToShow;
  s_prevSnapSlaveCount = slaveCount;
  s_prevNSlaveRows = nSlaveRows;
  s_prevHadOverflow = hasOverflow;
  strncpy(s_prevLineMac, line_mac, sizeof(s_prevLineMac) - 1);
  s_prevLineMac[sizeof(s_prevLineMac) - 1] = '\0';
  strncpy(s_prevLineSlaves, line_slaves, sizeof(s_prevLineSlaves) - 1);
  s_prevLineSlaves[sizeof(s_prevLineSlaves) - 1] = '\0';
  strncpy(s_prevOverflow, line_overflow, sizeof(s_prevOverflow) - 1);
  s_prevOverflow[sizeof(s_prevOverflow) - 1] = '\0';
  for (int i = 0; i < MAX_SLAVES; i++) {
    s_prevSlaveRow[i][0] = '\0';
  }
  for (int i = 0; i < nSlaveRows; i++) {
    strncpy(s_prevSlaveRow[i], slaveRows[i], sizeof(s_prevSlaveRow[0]) - 1);
    s_prevSlaveRow[i][sizeof(s_prevSlaveRow[0]) - 1] = '\0';
  }
}

void printMasterTime() {
  uint32_t currentMs = nowMs();

  int hours = (currentMs / 3600000UL) % 24;
  int minutes = (currentMs / 60000UL) % 60;
  int seconds = (currentMs / 1000UL) % 60;
  int milliseconds = currentMs % 1000UL;

  Serial.printf("🕐 Master Time: %02d:%02d:%02d.%03d\n",
                hours, minutes, seconds, milliseconds);
}

bool isSlaveKnown(const uint8_t *mac) {
  for (int i = 0; i < slaveCount; i++) {
    if (memcmp(mac, slaveList[i], 6) == 0) return true;
  }
  return false;
}

static unsigned long nowMsForSeen() {
  unsigned long t = millis();
  return (t == 0) ? 1UL : t;
}

static void markSlaveSeen(const uint8_t *mac) {
  for (int i = 0; i < slaveCount; i++) {
    if (memcmp(mac, slaveList[i], 6) == 0) {
      slaveLastSeenMs[i] = nowMsForSeen();
      return;
    }
  }
}

static void removeSlaveAt(int idx) {
  if (idx < 0 || idx >= slaveCount) {
    return;
  }
  esp_err_t del = esp_now_del_peer(slaveList[idx]);
  (void)del;
  Serial.print("⏱ Slave timeout (>");
  Serial.print((unsigned long)(SLAVE_RX_TIMEOUT_MS / 1000UL));
  Serial.print("s), removed: ");
  printMAC(slaveList[idx]);
  Serial.println();
  for (int j = idx; j < slaveCount - 1; j++) {
    memcpy(slaveList[j], slaveList[j + 1], 6);
    slaveLastSeenMs[j] = slaveLastSeenMs[j + 1];
    slaveLastSyncUs[j] = slaveLastSyncUs[j + 1];
    slaveLastSyncRttUs[j] = slaveLastSyncRttUs[j + 1];
    slaveLastRssi[j] = slaveLastRssi[j + 1];
    slaveRssiValid[j] = slaveRssiValid[j + 1];
    slaveRssiWinN[j] = slaveRssiWinN[j + 1];
    slaveRssiWinPos[j] = slaveRssiWinPos[j + 1];
    memcpy(slaveRssiWin[j], slaveRssiWin[j + 1], sizeof(slaveRssiWin[0]));
    slaveLastBatPct[j] = slaveLastBatPct[j + 1];
    slaveBatValid[j] = slaveBatValid[j + 1];
    slaveLastVcell[j] = slaveLastVcell[j + 1];
  }
  slaveCount--;
  requestTftRefresh();
}

static void checkSlaveTimeouts() {
  unsigned long now = millis();
  if (now == 0) {
    now = 1;
  }
  for (int i = slaveCount - 1; i >= 0; i--) {
    if (slaveLastSeenMs[i] == 0) {
      slaveLastSeenMs[i] = nowMsForSeen();
      continue;
    }
    if ((unsigned long)(now - slaveLastSeenMs[i]) >= SLAVE_RX_TIMEOUT_MS) {
      removeSlaveAt(i);
    }
  }
}

bool ensureSlavePeer(const uint8_t *mac) {
  if (isSlaveKnown(mac)) {
    markSlaveSeen(mac);
    return true;
  }
  if (slaveCount >= MAX_SLAVES) return false;

  esp_now_peer_info_t peerInfo = {};
  memcpy(peerInfo.peer_addr, mac, 6);
  peerInfo.channel = CHANNEL;
  peerInfo.ifidx = WIFI_IF_STA;
  peerInfo.encrypt = false;

  esp_err_t addResult = esp_now_add_peer(&peerInfo);
  if (addResult == ESP_OK) {
    memcpy(slaveList[slaveCount], mac, 6);
    slaveLastSeenMs[slaveCount] = nowMsForSeen();
    slaveLastSyncUs[slaveCount] = 0ULL;
    slaveLastSyncRttUs[slaveCount] = 0U;
    slaveRssiValid[slaveCount] = false;
    slaveRssiWinN[slaveCount] = 0U;
    slaveRssiWinPos[slaveCount] = 0U;
    slaveBatValid[slaveCount] = false;
    slaveLastBatPct[slaveCount] = 0;
    slaveLastVcell[slaveCount] = 0.0f;
    slaveCount++;
    Serial.printf("✅ Đã thêm slave #%d: ", slaveCount);
    printMAC(mac);
    Serial.println();
    requestTftRefresh();
    return true;
  } else if (addResult == ESP_ERR_ESPNOW_EXIST) {
    memcpy(slaveList[slaveCount], mac, 6);
    slaveLastSeenMs[slaveCount] = nowMsForSeen();
    slaveLastSyncUs[slaveCount] = 0ULL;
    slaveLastSyncRttUs[slaveCount] = 0U;
    slaveRssiValid[slaveCount] = false;
    slaveRssiWinN[slaveCount] = 0U;
    slaveRssiWinPos[slaveCount] = 0U;
    slaveBatValid[slaveCount] = false;
    slaveLastBatPct[slaveCount] = 0;
    slaveLastVcell[slaveCount] = 0.0f;
    slaveCount++;
    Serial.printf("ℹ️ Peer đã tồn tại, thêm vào danh sách slave #%d\n", slaveCount);
    requestTftRefresh();
    return true;
  } else {
    Serial.printf("❌ Lỗi thêm slave peer (%d)\n", addResult);
    return false;
  }
}

/** Theo dõi LOST theo từng chunk (≤32 seq); 1s timeout trên master, tối đa 3 lần gửi. */
#define MASTER_IMU_RETX_PENDING_MAX 16
#define MASTER_IMU_RETX_TMO_MS 1000U
#define MASTER_IMU_RETX_MAX_SENDS 3U

typedef struct {
  bool active;
  uint8_t mac[6];
  uint32_t node_id;
  uint32_t seq0;
  uint32_t n;
  uint32_t got_mask;
  uint32_t last_send_ms;
  uint8_t sends_done;
} MasterImuRetxPending;

static MasterImuRetxPending g_masterImuRetxPend[MASTER_IMU_RETX_PENDING_MAX];

static uint32_t masterImuRetxChunkFullMask(uint32_t n) {
  if (n == 0U) {
    return 0U;
  }
  if (n >= 32U) {
    return 0xFFFFFFFFU;
  }
  return (1UL << n) - 1U;
}

static void masterImuRetxMarkSample(const uint8_t *mac, uint32_t seq) {
  for (int i = 0; i < MASTER_IMU_RETX_PENDING_MAX; i++) {
    MasterImuRetxPending *p = &g_masterImuRetxPend[i];
    if (!p->active) {
      continue;
    }
    if (memcmp(p->mac, mac, 6) != 0) {
      continue;
    }
    if (p->n == 0U || p->n > 32U) {
      continue;
    }
    if (seq < p->seq0) {
      continue;
    }
    uint32_t bit = seq - p->seq0;
    if (bit >= p->n) {
      continue;
    }
    p->got_mask |= (1U << bit);
  }
}

static void masterImuRetxSendLostPacket(const uint8_t *mac, uint32_t node_id, uint32_t seq_first,
                                       uint32_t seq_count) {
  imu_lost_request_t rq = {};
  memcpy(rq.type, "IMU_LOST", 8);
  memcpy(rq.target_mac, mac, 6);
  rq.node_id = node_id;
  rq.seq_first = seq_first;
  rq.seq_count = seq_count;
  (void)esp_now_send(mac, (uint8_t *)&rq, sizeof(rq));
  Serial.printf(
      "IMU_LOG,LOST_REQ,%02X:%02X:%02X:%02X:%02X:%02X,%lu,%lu,%lu\n",
      mac[0], mac[1], mac[2], mac[3], mac[4], mac[5],
      (unsigned long)node_id, (unsigned long)seq_first, (unsigned long)seq_count);
}

static int masterImuRetxFindDup(const uint8_t *mac, uint32_t seq0, uint32_t n) {
  for (int i = 0; i < MASTER_IMU_RETX_PENDING_MAX; i++) {
    if (!g_masterImuRetxPend[i].active) {
      continue;
    }
    if (memcmp(g_masterImuRetxPend[i].mac, mac, 6) != 0) {
      continue;
    }
    if (g_masterImuRetxPend[i].seq0 == seq0 && g_masterImuRetxPend[i].n == n) {
      return i;
    }
  }
  return -1;
}

static int masterImuRetxFindFree(void) {
  for (int i = 0; i < MASTER_IMU_RETX_PENDING_MAX; i++) {
    if (!g_masterImuRetxPend[i].active) {
      return i;
    }
  }
  return -1;
}

static void masterImuRetxRegisterChunk(const uint8_t *mac, uint32_t node_id, uint32_t seq0, uint32_t n) {
  if (n == 0U || n > (uint32_t)MASTER_IMU_LOST_MAX_CHUNK) {
    return;
  }
  (void)ensureSlavePeer(mac);
  if (!esp_now_is_peer_exist(mac)) {
    return;
  }
  if (masterImuRetxFindDup(mac, seq0, n) >= 0) {
    return;
  }
  int idx = masterImuRetxFindFree();
  if (idx < 0) {
    Serial.println("IMU_LOG,RETX_PEND_FULL");
    return;
  }
  MasterImuRetxPending *p = &g_masterImuRetxPend[idx];
  memset(p, 0, sizeof(*p));
  p->active = true;
  memcpy(p->mac, mac, 6);
  p->node_id = node_id;
  p->seq0 = seq0;
  p->n = n;
  p->got_mask = 0U;
  p->last_send_ms = millis();
  p->sends_done = 1;
  masterImuRetxSendLostPacket(mac, node_id, seq0, n);
}

static void masterImuRetxTimeoutPoll(void) {
  const uint32_t now = millis();
  for (int i = 0; i < MASTER_IMU_RETX_PENDING_MAX; i++) {
    MasterImuRetxPending *p = &g_masterImuRetxPend[i];
    if (!p->active) {
      continue;
    }
    const uint32_t need = masterImuRetxChunkFullMask(p->n);
    if ((p->got_mask & need) == need) {
      p->active = false;
      continue;
    }
    if ((uint32_t)(now - p->last_send_ms) < MASTER_IMU_RETX_TMO_MS) {
      continue;
    }
    if (p->sends_done >= MASTER_IMU_RETX_MAX_SENDS) {
      Serial.printf(
          "IMU_LOG,RETX_DROP,%02X:%02X:%02X:%02X:%02X:%02X,%lu,%lu,%lu\n",
          p->mac[0], p->mac[1], p->mac[2], p->mac[3], p->mac[4], p->mac[5],
          (unsigned long)p->node_id, (unsigned long)p->seq0, (unsigned long)p->n);
      p->active = false;
      continue;
    }
    p->sends_done++;
    p->last_send_ms = now;
    masterImuRetxSendLostPacket(p->mac, p->node_id, p->seq0, p->n);
  }
}

static void masterSendImuLostForGap(MacSeqTrack *t, uint32_t seq_first, uint32_t nmiss, uint32_t node_id) {
  if (t == NULL || nmiss == 0U) {
    return;
  }
  for (uint32_t off = 0; off < nmiss; off += (uint32_t)MASTER_IMU_LOST_MAX_CHUNK) {
    uint32_t c = nmiss - off;
    if (c > (uint32_t)MASTER_IMU_LOST_MAX_CHUNK) {
      c = (uint32_t)MASTER_IMU_LOST_MAX_CHUNK;
    }
    masterImuRetxRegisterChunk(t->mac, node_id, seq_first + off, c);
  }
}

void sendAck(const uint8_t *dst) {
  packet_t ackPacket = {};
  strcpy(ackPacket.type, "ACK");
  WiFi.macAddress(ackPacket.mac);
  ackPacket.node_id = 0;
  ackPacket.timestamp = nowMs();
  ackPacket.micros_timestamp = nowUs();
  ackPacket.timezone_offset = masterTimezone;
  ackPacket.request_time = 0;
  ackPacket.response_time = 0;

  esp_err_t result = esp_now_send(dst, (uint8_t *)&ackPacket, sizeof(ackPacket));
  if (result == ESP_OK) {
    Serial.println("✅ Đã gửi ACK xác nhận kết nối");
  } else {
    Serial.printf("❌ Lỗi gửi ACK (%d)\n", result);
  }
}

static void masterNoteSlaveBatteryFromSync(const uint8_t *src,
                                           const esp_now_recv_info *info,
                                           uint16_t adcRaw) {
  int si = slaveIndexForMac(src);
  if (si >= 0) {
    float Vadc = adcRawToVadcPin(adcRaw);
    float Vcell = adcRawToVcellEst(adcRaw);
    uint8_t pct = adcRawToBatteryPct(adcRaw);
    slaveLastVcell[si] = Vcell;
    slaveLastBatPct[si] = pct;
    slaveBatValid[si] = true;
    Serial.printf(
        "SYNC,BAT,raw=%u,Vadc=%.3f,Vcell=%.3f(x%.1f),pct=%u "
        "(cell %.2f-%.2fV)\n",
        (unsigned)adcRaw, (double)Vadc, (double)Vcell,
        (double)VBAT_VCELL_PER_VADC, (unsigned)pct,
        (double)VBAT_CELL_EMPTY_V, (double)VBAT_CELL_FULL_V);
    if (info && info->rx_ctrl) {
      int rssi_gui = (int)info->rx_ctrl->rssi;
      Serial.printf("SYNC,GUI,mac=%s,pct=%u,rssi_dbm=%d\n",
                    macToString(src).c_str(), (unsigned)pct, rssi_gui);
    }
  } else {
    Serial.printf("SYNC,BAT,raw=%u (no slave idx)\n", (unsigned)adcRaw);
  }
}

void sendTimeResponse(const uint8_t *dst, const packet_t &syncPkt, uint64_t masterReceiveUs) {
  packet_t timePacket = {};
  strcpy(timePacket.type, "TIME");
  WiFi.macAddress(timePacket.mac);
  timePacket.node_id = 0;

  // t2: master nhận SYNC
  timePacket.timestamp = (uint32_t)(masterReceiveUs / 1000ULL);
  timePacket.micros_timestamp = masterReceiveUs;
  timePacket.timezone_offset = masterTimezone;

  // giữ nguyên t1 từ slave
  timePacket.request_time = syncPkt.request_time;

  // t3: master gửi TIME
  uint64_t masterSendUs = nowUs();
  timePacket.response_time = masterSendUs;

  esp_err_t result = esp_now_send(dst, (uint8_t *)&timePacket, sizeof(timePacket));

  if (result == ESP_OK) {
    int si = slaveIndexForMac(dst);
    if (si >= 0) {
      slaveLastSyncUs[si] = masterSendUs;
      /* RTT thật (µs) do slave đo ở vòng trước, gửi kèm gói SYNC tới; không có t4 trên master. */
      if (syncPkt.last_sync_rtt_us != 0U) {
        slaveLastSyncRttUs[si] = syncPkt.last_sync_rtt_us;
      } else {
        slaveLastSyncRttUs[si] =
            (uint32_t)(masterSendUs - masterReceiveUs); /* fallback: chỉ t3−t2 (xử lý master) */
      }
      requestTftRefresh();
    }
    Serial.printf("📤 TIME sent | t2=%llu us | t3=%llu us | proc(t3-t2)=%llu us | "
                  "slave_rtt_in_SYNC=%lu us\n",
                  (unsigned long long)masterReceiveUs,
                  (unsigned long long)masterSendUs,
                  (unsigned long long)(masterSendUs - masterReceiveUs),
                  (unsigned long)syncPkt.last_sync_rtt_us);
  } else {
    Serial.printf("❌ Lỗi gửi TIME (%d)\n", result);
  }
}

