caonam-tugraz/MultiIMU-GaitSync/firmware/master_tft/ESP32_ESP_NOW_TIME_SYNC_MASTER_TFT_2_0/ESP32_ESP_NOW_TIME_SYNC_MASTER_TFT_2_0.ino
  // ---- IMU packet float (slave cũ) ----
  if (len == (int)sizeof(imu_packet_t)) {
    imu_packet_t imu;
    memcpy(&imu, incomingData, sizeof(imu));

    if (strncmp(imu.type, "IMU", 3) == 0) {
#if IMU_SERIAL_BINARY
      /* Gói float cũ: không có sample_seq hợp lệ (raw=0) — gửi không lọc seq. */
      serialWriteImuRawFrameImpl(floatImuPacketToRaw(imu));
#else
      Serial.printf(
        "IMU,%02X:%02X:%02X:%02X:%02X:%02X,%llu,%llu,0,%.6f,%.6f,%.6f,%.6f,%.6f,%.6f\n",
        src[0], src[1], src[2], src[3], src[4], src[5],
        (unsigned long long)imu.micros_timestamp,
        (unsigned long long)nowUs(),
        imu.ax, imu.ay, imu.az,
        imu.gx, imu.gy, imu.gz
      );
#endif
      return;
    }
  }

  // ---- VL53 packet ----
  if (len == (int)sizeof(vl53_packet_t)) {
    vl53_packet_t vl53;
    memcpy(&vl53, incomingData, sizeof(vl53));

    if (strncmp(vl53.type, "VL53", 4) == 0) {
#if IMU_SERIAL_BINARY
      serialWriteVl53RawFrame(vl53);
#else
#if MASTER_SERIAL_SEQ_FILTER
      if (!vl53SerialShouldForward(vl53.mac, vl53.sample_seq)) {
        return;
      }
#endif
      Serial.printf("VL53,%02X:%02X:%02X:%02X:%02X:%02X,%lu,%llu,%lu",
                    src[0], src[1], src[2], src[3], src[4], src[5],
                    (unsigned long)vl53.timestamp,
                    (unsigned long long)vl53.micros_timestamp,
                    (unsigned long)vl53.sample_seq);
      for (int i = 0; i < VL53_ZONE_COUNT; i++) {
        Serial.printf(",%d", (int)vl53.distance_raw[i]);
      }
      Serial.println();
#endif
      return;
    }
  }

  // ---- control packet ----
  if (len == (int)sizeof(packet_t)) {
    packet_t pkt;
    memcpy(&pkt, incomingData, sizeof(pkt));

    if (strcmp(pkt.type, "CACK") == 0) {
      Serial.printf("CALIB_ACK,%02X:%02X:%02X:%02X:%02X:%02X,OK\n",
                    src[0], src[1], src[2], src[3], src[4], src[5]);
      return;
    }

    if (strcmp(pkt.type, "CERR") == 0) {
      Serial.printf("CALIB_ACK,%02X:%02X:%02X:%02X:%02X:%02X,FAIL\n",
                    src[0], src[1], src[2], src[3], src[4], src[5]);
      return;
    }
  }

  packet_t pkt = {};
  if (len == (int)sizeof(packet_t)) {
    memcpy(&pkt, incomingData, sizeof(pkt));
  } else if (len == (int)offsetof(packet_t, last_sync_rtt_us)) {
    /* Firmware slave cũ: chưa có last_sync_rtt_us */
    memcpy(&pkt, incomingData, (size_t)len);
    pkt.last_sync_rtt_us = 0;
  } else {
    return;
  }

  if (strcmp(pkt.type, "HELLO") == 0) {
    Serial.print("📩 HELLO từ ");
    printMAC(src);
    Serial.println();

    ensureSlavePeer(src);
    noteSlaveRssiIfKnown(info, src);
    sendAck(src);
    return;
  }

  if (strcmp(pkt.type, "SYNC") == 0) {
    ensureSlavePeer(src);
    noteSlaveRssiIfKnown(info, src);
    masterNoteSlaveBatteryFromSync(src, info, pkt.slave_adc_raw);
    sendTimeResponse(src, pkt, rxUs);
    return;
  }
}

void printMasterMAC() {
  uint8_t mac[6];
#if ESP_IDF_VERSION_MAJOR >= 5
  esp_wifi_get_mac(WIFI_IF_STA, mac);
#else
  esp_read_mac(mac, ESP_MAC_WIFI_STA);
#endif
  Serial.print("🚀 Master MAC: ");
  printMAC(mac);
  Serial.println();
}

void setupRadio() {
  WiFi.mode(WIFI_STA);
  WiFi.disconnect(true, true);
  esp_wifi_set_ps(WIFI_PS_NONE);
  esp_wifi_set_channel(CHANNEL, WIFI_SECOND_CHAN_NONE);

#if USE_LONG_RANGE
  esp_wifi_set_protocol(WIFI_IF_STA,
                        WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G |
                        WIFI_PROTOCOL_11N | WIFI_PROTOCOL_LR);
#else
  esp_wifi_set_protocol(WIFI_IF_STA,
                        WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G |
                        WIFI_PROTOCOL_11N);
#endif

#if MASTER_WIFI_TX_POWER_ADAPTIVE
  masterWifiTxPowerInit();
#else
  esp_wifi_set_max_tx_power(MAX_TX_POWER);
#endif

  uint8_t ch;
  wifi_second_chan_t sc;
  esp_wifi_get_channel(&ch, &sc);
  Serial.printf("Wi-Fi channel locked at %u%s\n", ch, USE_LONG_RANGE ? " (LR ON)" : "");
}

void setup() {
  Serial.setTxBufferSize(8192);
  Serial.begin(921600);
  delay(200);

  esp_bt_controller_mem_release(ESP_BT_MODE_BTDM);

  // ESP32 Arduino 3.x: LEDC theo chân (không dùng ledcSetup/ledcAttachPin)
  ledcAttach(TFT_LED, LEDC_FREQ, LEDC_RES);
  ledcWrite(TFT_LED, 255);

  tft.init(TFT_WIDTH, TFT_HEIGHT);
  tft.setSPISpeed(TFT_SPI_HZ);
  tft.setRotation(0);
  clearFullScreen();
  uiFont();
  {
    const char kSplashTail[] = " RECODER...";
    const int16_t splashGap = 9;
    int16_t x1i, y1i, x1r, y1r;
    uint16_t wi, hi, wr, hr;
    tft.setFont(&orbitron_medium18pt7b);
    tft.setTextSize(1);
    tft.getTextBounds("IMU", 0, 0, &x1i, &y1i, &wi, &hi);
    tft.setFont(&orbitron_medium8pt7b);
    tft.getTextBounds(kSplashTail, 0, 0, &x1r, &y1r, &wr, &hr);
    int16_t spanImu = x1i + (int16_t)wi;
    int16_t leftAbs = x1i;
    if (spanImu + splashGap + x1r < leftAbs) {
      leftAbs = spanImu + splashGap + x1r;
    }
    int16_t rightAbs = spanImu + splashGap + x1r + (int16_t)wr;
    int16_t totalW = rightAbs - leftAbs;
    int16_t ty1 = (y1i < y1r) ? y1i : y1r;
    int16_t bottom =
        (y1i + (int16_t)hi > y1r + (int16_t)hr) ? (y1i + (int16_t)hi) : (y1r + (int16_t)hr);
    int16_t th = bottom - ty1;
    int16_t cx = tft.width() / 2;
    int16_t cy = tft.height() / 2;
    int16_t xImu = cx - totalW / 2 - leftAbs;
    int16_t y = cy - th / 2 - ty1;
    tft.setTextColor(ST77XX_ORANGE);
    tft.setFont(&orbitron_medium18pt7b);
    tft.setCursor(xImu, y);
    tft.print("IMU");
    tft.setFont(&orbitron_medium8pt7b);
    tft.setCursor(xImu + spanImu + splashGap, y);
    tft.print(kSplashTail);
    uiFont();
  }

  Serial.println("\n=== ESP-NOW TIME SYNC MASTER ===");

  setupRadio();

  printMasterMAC();
  Serial.println("----------------------------------");

  if (esp_now_init() != ESP_OK) {
    Serial.println("❌ Lỗi khởi tạo ESP-NOW!");
    return;
  }

  esp_now_register_recv_cb(onDataRecv);

  Serial.println("✅ Master sẵn sàng, chờ slave kết nối...");
  printMasterTime();
  requestTftRefresh();
}

void loop() {
  processSerialCommands();

  checkSlaveTimeouts();
#if MASTER_IMU_LOST_REQUEST_ENABLE
  masterImuRetxTimeoutPoll();
#endif

  static unsigned long s_lastRssiTftMs = 0;
  {
    const unsigned long nowm = millis();
    if (slaveCount > 0 && (nowm - s_lastRssiTftMs >= SLAVE_RSSI_TFT_INTERVAL_MS)) {
      s_lastRssiTftMs = nowm;
      updateSlaveRssiDisplayFromWindows();
      requestTftRefresh();
    }
  }

  if (millis() - lastPrint > 5000) {
#if !IMU_SERIAL_BINARY
    printSlaveList();
#endif
    requestTftRefresh();
    lastPrint = millis();
  }

  if (g_tftRefreshPending) {
    g_tftRefreshPending = false;
    drawMasterStatusScreen();
  }

  delay(1);
}